# Delete & Insert

# Insert :

In [2]:
import pandas as pd

df = pd.DataFrame({"A" : [1,2,3,4], "B":[5,6,7,8]})
print(df)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [9]:
#insert
df.insert(3,"insss",df["A"])
df

   A  ins  inss  insss  B
0  1    1     1      1  5
1  2    2     2      2  6
2  3    3     3      3  7
3  4    4     4      4  8

In [10]:
df.insert(1,"newins",[55,66,88,99])
df

   A  newins  ins  inss  insss  B
0  1      55    1     1      1  5
1  2      66    2     2      2  6
2  3      88    3     3      3  7
3  4      99    4     4      4  8

In [11]:
#data Copy

df["copy"] = df["A"][:2]
df

   A  newins  ins  inss  insss  B  copy
0  1      55    1     1      1  5   1.0
1  2      66    2     2      2  6   2.0
2  3      88    3     3      3  7   NaN
3  4      99    4     4      4  8   NaN

# Delete:

In [15]:
pop = df.pop("inss")
print(pop)
df

0    1
1    2
2    3
3    4
Name: inss, dtype: int64

   A  newins  ins  B  copy
0  1      55    1  5   1.0
1  2      66    2  6   2.0
2  3      88    3  7   NaN
3  4      99    4  8   NaN

In [17]:
del df["ins"]
df

   A  newins  B  copy
0  1      55  5   1.0
1  2      66  6   2.0
2  3      88  7   NaN
3  4      99  8   NaN